---
kind: method
id: M:Autodesk.Revit.DB.IFC.ExporterIFCUtils.SetGlobal2DOriginHandle(Autodesk.Revit.DB.IFC.IFCAnyHandle)
source: html/c3bb666d-883e-a47b-d295-8095000633ef.htm
---
# Autodesk.Revit.DB.IFC.ExporterIFCUtils.SetGlobal2DOriginHandle Method

Sets the handle representing the 2D origin.

## Syntax (C#)
```csharp
public static void SetGlobal2DOriginHandle(
	IFCAnyHandle origin
)
```

## Parameters
- **origin** (`Autodesk.Revit.DB.IFC.IFCAnyHandle`) - The origin handle.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null